---
kind: other
id: Methods.T:Autodesk.Revit.DB.RoofBase
source: html/bcacb9f9-80e2-6c1f-b481-0e11cebfbf17.htm
---
# RoofBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.